import React from 'react'

function OrganizationInfo() {
  return (
      <div className="flex flex-col grow py-7 w-full bg-white rounded-2xl shadow-sm max-md:mt-5 max-md:max-w-full">
        <img
          alt=""
          loading="lazy"
          srcSet="https://api.builder.io/api/v1/image/assets/e969867fc0a145258ec2d2dcaf1c3295/f1870bda4f2d5034102b7b3e4a12224512b78643?apiKey=e969867fc0a145258ec2d2dcaf1c3295&width=100 100w, https://api.builder.io/api/v1/image/assets/e969867fc0a145258ec2d2dcaf1c3295/f1870bda4f2d5034102b7b3e4a12224512b78643?apiKey=e969867fc0a145258ec2d2dcaf1c3295&width=200 200w, https://api.builder.io/api/v1/image/assets/e969867fc0a145258ec2d2dcaf1c3295/f1870bda4f2d5034102b7b3e4a12224512b78643?apiKey=e969867fc0a145258ec2d2dcaf1c3295&width=400 400w, https://api.builder.io/api/v1/image/assets/e969867fc0a145258ec2d2dcaf1c3295/f1870bda4f2d5034102b7b3e4a12224512b78643?apiKey=e969867fc0a145258ec2d2dcaf1c3295&width=800 800w, https://api.builder.io/api/v1/image/assets/e969867fc0a145258ec2d2dcaf1c3295/f1870bda4f2d5034102b7b3e4a12224512b78643?apiKey=e969867fc0a145258ec2d2dcaf1c3295&width=1200 1200w, https://api.builder.io/api/v1/image/assets/e969867fc0a145258ec2d2dcaf1c3295/f1870bda4f2d5034102b7b3e4a12224512b78643?apiKey=e969867fc0a145258ec2d2dcaf1c3295&width=1600 1600w, https://api.builder.io/api/v1/image/assets/e969867fc0a145258ec2d2dcaf1c3295/f1870bda4f2d5034102b7b3e4a12224512b78643?apiKey=e969867fc0a145258ec2d2dcaf1c3295&width=2000 2000w, https://api.builder.io/api/v1/image/assets/e969867fc0a145258ec2d2dcaf1c3295/f1870bda4f2d5034102b7b3e4a12224512b78643?apiKey=e969867fc0a145258ec2d2dcaf1c3295&"
          className="object-contain self-start mr-10 max-w-full aspect-[3.62] w-[116px] max-md:mr-2.5"
        />
        <div className="flex flex-col px-5 mt-4 max-md:pl-5 max-md:max-w-full">
          <div className="text-xs leading-5 text-right text-stone-500 max-md:mr-2.5 max-md:max-w-full">
            <span className="font-bold text-stone-500">
              شركة الرؤية المستقبلية للتقنيات
            </span>{" "}
            هي إحدى الشركات السعودية الرائدة في مجال التحول الرقمي، وتسعى
            إلى تمكين كوادرها من خلال برامج تدريبية متخصصة تهدف إلى رفع
            الكفاءة وتعزيز الإنتاجية داخل بيئة العمل.
          </div>
          <img
            alt=""
            loading="lazy"
            src="https://api.builder.io/api/v1/image/assets/e969867fc0a145258ec2d2dcaf1c3295/16d716db598d2e655c749b7cf942f1b512e455c1?apiKey=e969867fc0a145258ec2d2dcaf1c3295&"
            className="object-contain mt-4 ml-3 w-full max-md:max-w-full"
          />
          <div className="flex flex-col justify-center mt-4 max-w-full text-sm w-[227px] max-md:mr-2.5">
            <div className="flex flex-col w-full text-right text-gray-700">
              <div>
                <span className="font-bold text-blue-600">
                  اسم المنشأة:{" "}
                </span>
                شركة الرؤية المستقبلية للتقنيات
              </div>
              <div className="mt-3">
                <span className="font-bold text-blue-600">المجال:</span>{" "}
                تقنية معلومات
              </div>
              <div className="mt-3">
                <span className="font-bold text-blue-600">
                  عدد الموظفين:
                </span>{" "}
                125 موظف
              </div>
              <div className="mt-3">
                <span className="font-bold text-blue-600">المدينة: </span>
                الرياض، السعودية
              </div>
              <div className="mt-3">
                <span className="font-bold text-blue-600">
                  خطة الاشتراك:{" "}
                </span>
                باقة الشركات المتقدمة
              </div>
              <div className="mt-3">
                <span className="font-bold text-blue-600">
                  تاريخ التسجيل:
                </span>{" "}
                12 فبراير 2024
              </div>
              <div className="mt-3">
                <span className="font-bold text-blue-600">
                  تاريخ إنتهاء الإشتراك :
                </span>{" "}
                12 فبراير 2025
              </div>
            </div>
            <div className="flex gap-5 items-center mt-5 w-full font-bold text-blue-600">
              <div className="self-stretch my-auto">
                حسابات التواصل :
              </div>
              <div className='flex gap-4 justify-center items-center'>
                <div className='cursor-pointer'><svg width="16" height="17" viewBox="0 0 16 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M11.1188 2.97284C11.8609 2.97503 12.572 3.26693 13.0968 3.78481C13.6216 4.30268 13.9173 5.00443 13.9196 5.73681V11.2642C13.9173 11.9965 13.6216 12.6983 13.0968 13.2162C12.572 13.734 11.8609 14.0259 11.1188 14.0281H5.51783C4.7757 14.0259 4.0646 13.734 3.53983 13.2162C3.01506 12.6983 2.71927 11.9965 2.71705 11.2642V5.73681C2.71927 5.00443 3.01506 4.30268 3.53983 3.78481C4.0646 3.26693 4.7757 2.97503 5.51783 2.97284H11.1188V2.97284ZM11.1188 1.86743H5.51783C3.36129 1.86743 1.59692 3.60861 1.59692 5.73681V11.2642C1.59692 13.3924 3.36129 15.1335 5.51783 15.1335H11.1188C13.2753 15.1335 15.0397 13.3924 15.0397 11.2642V5.73681C15.0397 3.60861 13.2753 1.86743 11.1188 1.86743V1.86743Z" fill="#216ED7" />
                  <path d="M11.9591 5.73663C11.7929 5.73663 11.6305 5.68801 11.4923 5.5969C11.3541 5.50579 11.2464 5.3763 11.1829 5.2248C11.1193 5.07329 11.1026 4.90658 11.135 4.74575C11.1675 4.58491 11.2475 4.43717 11.365 4.32122C11.4825 4.20526 11.6322 4.12629 11.7952 4.0943C11.9581 4.06231 12.1271 4.07873 12.2806 4.14148C12.4341 4.20424 12.5653 4.31051 12.6576 4.44686C12.75 4.58321 12.7992 4.74351 12.7992 4.9075C12.7995 5.01645 12.7779 5.12437 12.7358 5.22507C12.6936 5.32577 12.6318 5.41727 12.5537 5.49431C12.4756 5.57135 12.3829 5.63241 12.2809 5.674C12.1788 5.71558 12.0695 5.73687 11.9591 5.73663V5.73663Z" fill="#216ED7" />
                  <path d="M8.31833 6.289C8.76148 6.289 9.19467 6.41868 9.56312 6.66164C9.93158 6.90461 10.2188 7.24993 10.3883 7.65396C10.5579 8.05799 10.6023 8.50257 10.5158 8.93149C10.4294 9.3604 10.216 9.75439 9.90265 10.0636C9.5893 10.3728 9.19007 10.5834 8.75545 10.6688C8.32082 10.7541 7.87032 10.7103 7.46091 10.5429C7.0515 10.3756 6.70157 10.0922 6.45538 9.72855C6.20918 9.36494 6.07777 8.93744 6.07777 8.50012C6.07841 7.91389 6.31467 7.35185 6.73472 6.93732C7.15477 6.52279 7.7243 6.28963 8.31833 6.289V6.289ZM8.31833 5.18359C7.65365 5.18359 7.0039 5.3781 6.45123 5.74253C5.89857 6.10695 5.46782 6.62492 5.21346 7.23094C4.9591 7.83696 4.89254 8.5038 5.02222 9.14714C5.15189 9.79049 5.47197 10.3814 5.94197 10.8453C6.41197 11.3091 7.01079 11.625 7.6627 11.7529C8.31461 11.8809 8.99033 11.8152 9.60442 11.5642C10.2185 11.3132 10.7434 10.8881 11.1126 10.3427C11.4819 9.79729 11.679 9.15607 11.679 8.50012C11.679 7.62052 11.325 6.77695 10.6947 6.15498C10.0645 5.53301 9.20965 5.18359 8.31833 5.18359V5.18359Z" fill="#216ED7" />
                </svg>
                </div>
                <div className='cursor-pointer'><svg width="20" height="19" viewBox="0 0 20 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M18.5521 4.29455C17.9038 4.57255 17.2178 4.7557 16.5159 4.83822C17.2536 4.41194 17.8083 3.73473 18.0761 2.93359C17.3787 3.33604 16.6169 3.61843 15.8235 3.76864C15.4894 3.42308 15.0875 3.14818 14.6424 2.96064C14.1973 2.77311 13.7182 2.67686 13.2342 2.67774C11.2747 2.67774 9.68889 4.21992 9.68889 6.12101C9.6875 6.38544 9.7182 6.64908 9.78034 6.90631C8.37522 6.84131 6.99932 6.48757 5.74067 5.86774C4.48201 5.2479 3.36832 4.37562 2.47084 3.3067C2.15598 3.83051 1.98947 4.42817 1.9887 5.03721C1.9887 6.23116 2.61991 7.28653 3.57303 7.90482C3.00833 7.8916 2.45521 7.7441 1.96062 7.47486V7.5175C1.96062 9.18761 3.18487 10.577 4.8052 10.8933C4.5005 10.9734 4.18651 11.014 3.87117 11.0141C3.64741 11.0145 3.42416 10.993 3.20467 10.9501C3.65513 12.3182 4.96616 13.3131 6.51915 13.3416C5.25723 14.3013 3.70792 14.82 2.11473 14.8162C1.83193 14.8158 1.5494 14.7992 1.26855 14.7665C2.88931 15.7878 4.77332 16.328 6.69631 16.3229C13.2266 16.3229 16.7942 11.0745 16.7942 6.52254C16.7942 6.3733 16.7903 6.22405 16.7831 6.07836C17.4755 5.59228 18.0746 4.98821 18.5521 4.29455Z" fill="#216ED7" />
                </svg>
                </div>
                <div className='cursor-pointer'><svg width="16" height="17" viewBox="0 0 16 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M15.6475 8.50007C15.6475 4.31556 12.2061 0.919434 7.96589 0.919434C3.72565 0.919434 0.284302 4.31556 0.284302 8.50007C0.284302 12.1691 2.92677 15.2241 6.42957 15.9291V10.7743H4.89325V8.50007H6.42957V6.60491C6.42957 5.14185 7.63558 3.95169 9.11812 3.95169H11.0385V6.22588H9.5022C9.07972 6.22588 8.73404 6.56701 8.73404 6.98394V8.50007H11.0385V10.7743H8.73404V16.0428C12.6132 15.6638 15.6475 12.4344 15.6475 8.50007Z" fill="#216ED7" />
                </svg>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
  )
}

export default OrganizationInfo
